src/Catalogs/КоллекцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>КоллекцииНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>гф_Номер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Год</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ТехническийЛимит</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаНачалаФормированияЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаОкончанияФормированияЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаНачалаОтгрузкиЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаОкончанияОтгрузкиЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаОкончанияРедактированияСкидок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_ДатаИзготовления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КоллекцииНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022
	ТипПолеФормы = Тип("ПолеФормы");

	НовыйЭлемент = Элементы.Вставить("Код", ТипПолеФормы, Элементы.Список, Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.Код";
	НовыйЭлемент.Заголовок = "Код"; 
		
    НовыйЭлемент = Элементы.Вставить("гф_Номер", ТипПолеФормы, Элементы.Список, Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_Номер";
	НовыйЭлемент.Заголовок = "Номер";

	Элементы.Переместить(Элементы.Наименование, Элементы.Список, Элементы.Список.ПодчиненныеЭлементы.гф_Номер);
	
	НовыйЭлемент = Элементы.Вставить("гф_Год", ТипПолеФормы, Элементы.Список, Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_Год";
	НовыйЭлемент.Заголовок = "Год";
	
	НовыйЭлемент = Элементы.Вставить("гф_ТехническийЛимит", ТипПолеФормы, Элементы.Список, Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ТехническийЛимит";
	НовыйЭлемент.Заголовок = "Технический лимит";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов", ТипПолеФормы, Элементы.Список, 
					Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаНачалаФормированияЗаказов";
	НовыйЭлемент.Заголовок = "Формирование заказов Начало"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов", ТипПолеФормы, Элементы.Список, 
					Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияФормированияЗаказов";
	НовыйЭлемент.Заголовок = "Формирование заказов Окончание"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов", ТипПолеФормы, Элементы.Список, 
					Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаНачалаОтгрузкиЗаказов";
	НовыйЭлемент.Заголовок = "Отгрузка заказов Начало";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов", ТипПолеФормы, Элементы.Список, 
					Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияОтгрузкиЗаказов";
	НовыйЭлемент.Заголовок = "Отгрузка заказов Окончание";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок", ТипПолеФормы, Элементы.Список, 
					Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияРедактированияСкидок";
	НовыйЭлемент.Заголовок = "Дата окончания редактирования скидок"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаИзготовления", ТипПолеФормы, Элементы.Список, Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаИзготовления";
	НовыйЭлемент.Заголовок = "Дата изготовления"; 
    // -- Галфинд_Домнышева_30_06_2022

КонецПроцедуры

#КонецОбласти
